![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

# <b> Práctica Clase 2 </b>

Con el objetivo de asegurarse de que la calidad de la información con la que se va a trabajar sea la óptima, es necesario realizar una lista de propuestas de mejora teniendo en cuenta los siguientes puntos:

## <b> Ítems </b>


1.  ¿Qué tan actualizada está la información? ¿La forma en que se actualiza ó mantiene esa información se puede mejorar? <br>

*   Tablas con el campo fecha:

    *   compra: ultimo registro cargado el 25-dic-2020.
    *   venta: ultimo registro cargado el 30-dic-2020.
    *   gasto: ultimo registro cargado el 01-dic-2020.

Los datos no están vigentes, por lo tanto no pueden ser implementados para la toma de decisiones estatégicas, ya que están siendo evalaudos 2 años depues de haber sido almacenados, si bien es muy pronto para asumir que los datos presentan cesgos, no es arriesgado asumir a priori que no describen la realidad actual de la empresa.

Se puede definir un periodo de actualización de datos, que reflejen en tiempo real la realidad de la empresa, este periodo suele definir en función experiencia, de otro mode debe obedecer al los requrimientos de la autoridad compenete que regule su campo de operación.

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)


2.  ¿Los datos están completos en todas las tablas? <br>

3.  ¿Se conocen las fuentes de los datos?

No, no se conoce la fuente de los datos.

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

4.  Al integrar éstos datos, es prudente que haya una normalización respecto de nombrar las tablas y sus campos.

Si, es prudente normalizar los identificadores de los campos y tablas ya que facilita la recuperación de los datos y la correlatividad entre los registros a la hora de generar las relaciones.

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

5.  Es importante revisar la consistencia de los datos: ¿Se pueden relacionar todas las tablas al modelo? ¿Cuáles son las tablas de hechos y las tablas dimensionales o maestros? ¿Podemos hacer esa separación en los datos que tenemos (tablas de hecho y dimensiones)? ¿Hay claves duplicadas? ¿Cuáles son variables cualitativas y cuáles son cuantitativas? ¿Qué acciones podemos aplicar sobre las mismas?

*   <b> Tablas de Hechos </b>:
  
    *   Venta: registro de la venta.
  
    *   Compra: registro de la compra.
  
    *   Gastos: registro de las deducciones hechas de caja para efecto de la operación del negocio.
  
*   <b> Tablas de Dimensiones </b>:

    *   Clientes: registra los clientes atendidos.

    *   Sucursales: registras las franquicias del negocio.

    *   Tipo de Gatos: registras los conceptos de las deducciones hechas de las caja del negocio para efectos de su operatividad.

    *   Empleados: registra los datos del empleado.

    *   Prodcusto: catalogo de ítems vendido en la tiempo.

    *   Proveedores: registro de proveedores y subcontratados por el negocio.

    *   Canal de Ventas: registra los medios a través de los cuales el negocio comercializa los artículos.

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

6.  Normalizar los nombres de los campos y colocar el tipo de dato adecuado para cada uno en cada una de las tablas. Descartar columnas que consideres que no tienen relevancia.

In [ ]:
/* modificar tipo de datos */

-- tabla: `venta`
-- campo: `cantidad`	    INTEGER

-- creo un nuevo campo llamado `aux_venta`
-- paso los datos de `canitdad` a `aux_cantidad`
-- borro la columna `cantidad`
-- cambio el nombre a la columna `aux_cantidad` por `cantidad`

1)   Crear campo `aux_venta` en la tabla `venta`.

In [ ]:
ALTER TABLE `venta` ADD `aux_cantidad` INTEGER;

-- SHOW FULL COLUMNS FROM `venta`; # muestra una descripcion de la tabla

2.   Mover los datos de `cantidad` a `aux_venta`.

In [ ]:
UPDATE `venta`	SET `aux_cantidad` = `cantidad`;

<b> Arroja el error </b>

*   <i> Error Code: 1175. You are using safe update mode and you tried to update a table without a WHERE that uses a KEY column. <br>
*   To disable safe mode, toggle the option in Preferences -> SQL Editor -> Query Editor and reconnect </i> .

<b> Solución </b>

*   Desde la versión 5.2.26 viene la opción <i> safe-update </i> (actualización en modo seguro) establecida por defecto. Esto significa que no se puede modificar ningún registro (<i> Delete, Update, Truncate </i>) sin especificar la clave en la claúsula <i> Where </i>.

*   Para deshabilitar el modo seguro:

```sql
    SET SQL_SAFE_UPDATES = 0;
```

*   Para habilitar el modo seguro:

```sql
    SET SQL_SAFE_UPDATES = 1;
```


<b> Ejercutar consulta </b> :

In [ ]:
UPDATE `venta`	SET `aux_cantidad` = `cantidad`;

<b> Arroja el error </b>

*   <i> Error SQL (1366) : Incorrect integer value: '' for column 'canitdad' at row 72 </i>.


<b> Ejercutar consulta </b> :

In [ ]:
SELECT * FROM `venta` 
WHERE `id_venta` = 72;

UPDATE `venta` SET `cantidad` = NULL WHERE `id_venta` = 72;

El campo está vacío, almacenó el salto de línea, nos obstante, al realizar la consulta: 

```sql
    SELECT * FROM venta 
    WHERE cantidad = '' OR cantidad IS NULL;

```

No arroja ninguna coincidencia, pues los parametros seteados no correspondel al carácter del salto de linea.

<b> Solución </b>

*   En windows, el salto de linea es representado, en la mayoría de las ocaciones por: `\r\n`, no obstante tambie es frecuente encontrar archivos en los cuales el salto de línea es denotado por: `\n` (esto último depende en gran mendida de como fue generado el .csv). <br>
    *   Para 'decirle' a MySQL que busque mediante dicho parámetro es necesario contruir la consulta de la siguiente manera.
    
        ```sql
        SELECT * FROM venta 
        WHERE cantidad = CHAR(10) + CHAR(13);

        ```

*   En Linux, unix y iOS es representado por: `\n`. <br>
    *   Para 'decirle' a MySQL que busque mediante dicho parámetro es necesario contruir la consulta de la siguiente manera.
    
        ```sql
        SELECT * FROM venta 
        WHERE cantidad = CHAR(10);

        ```

| Representación | Caracter|
| :------------: | :-----: |
| CHAR(10)       | \n      |
| CHAR(13)       | \r      |


<b> Ejercutar consulta </b> :

In [ ]:
UPDATE `venta`  SET `cantidad` = NULL WHERE `cantidad` = CHAR(10) + CHAR(13);

A través de la consulta anterior se identificaron los campos que almacenaron el salto de línea y luego se cargo en estos el valor nulo.


<b> Ejercutar consulta </b> :

In [ ]:
UPDATE `venta`	SET `aux_cantidad` = `cantidad`;

A través de la consulta anterior se copiaron los registro de la columna `cantidad` en la columna `aux_cantidad`. <br>

La instrucción:

```sql
    SHOW FULL COLUMNS FROM `venta`
```
Muestra la información característica de cada una de las columnas que conforman la tabla.

3.   Borrar la columna cantidad `cantidad`.

In [ ]:
ALTER TABLE `venta` DROP COLUMN `cantidad`;

4.   Cambiar el nombre de la columna `aux_cantidad` por `cantidad`.

In [ ]:
ALTER TABLE `venta` RENAME COLUMN `aux_cantidad` TO `cantidad`;

<b> Variación </b>

*   Omitiendo el paso 1 y ejecutando unicamente la consulta:

    ```sql 
        UPDATE `venta`  SET `cantidad` = NULL WHERE `cantidad` = CHAR(10) + CHAR(13);
    ``` 

*   en el paso 2, se puede modificar el tipo de datos de la columna `cantidad` sin necesidad de trasladar los datos, aplicando:

    ```sql 
        ALTER TABLE `venta` MODIFY `cantidad` INTEGER;
    ``` 
    ![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

<b> Consideraciones Adicionales </b>

Guardar en la tabla `aux_venta`, los registros que presentan problemas en la tabla, antes de realizar cualquier cambio, para luego remitirlo a la dirección y que sea evalaudo el proceso de captura de datos y se determine la manera más efectiva de tratar la información faltante.

In [ ]:
/* modificar tipo de datos */

-- tabla: `tipo_gasto`
-- campo: `id_tipo_gasto`   INTEGER

In [ ]:
ALTER TABLE `tipo_gasto` MODIFY `id_tipo_gasto` INTEGER;

In [ ]:
/* modificar tipo de datos */

-- tabla: `producto`
-- campo: `precio`       DECIMAL(10,2)

In [ ]:
SELECT MAX(CHAR_LENGTH(`concepto`)) FROM `producto`;

-- CHAR_LENGTH = 12

In [ ]:
ALTER TABLE `producto` MODIFY `precio` DECIMAL(15,2);

In [ ]:
/* modificar tipo de datos */

-- tabla: `empleado`
-- campo: `salario`       DECIMAL(10,2)

In [ ]:
SELECT MAX(CHAR_LENGTH(`empleado`)) FROM `salario`;

-- CHAR_LENGTH = 5

In [ ]:
ALTER TABLE `empleado` MODIFY `salario` DECIMAL(10,2);

In [ ]:
/* eliminar campo */

-- tabla: `compra`
-- campo: `precio`

-- tabla: `venta`
-- campo: `precio`

-- tabla: `cliente`
-- campo: `x`
-- campo: `y`
-- campo: `col10`

-- tabla: `sucursal`
-- campo: `latitud`
-- campo: `longitud`

In [ ]:
/* eliminar campo */

-- tabla: `compra`
-- campo: `precio`

In [ ]:
ALTER TABLE `compra` DROP COLUMN `precio`;

In [ ]:
/* eliminar campo */

-- tabla: `venta`
-- campo: `precio`

In [ ]:
ALTER TABLE `venta` DROP COLUMN `precio`;

In [ ]:
/* eliminar campo */

-- tabla: `cliente`
-- campo: `x`
-- campo: `y`
-- campo: `col10`

In [ ]:
ALTER TABLE `venta` DROP COLUMN `x`;
ALTER TABLE `venta` DROP COLUMN `y`;
ALTER TABLE `venta` DROP COLUMN `col10`;

In [ ]:
/* eliminar campo */

-- tabla: `sucursal`
-- campo: `latitud`
-- campo: `longitud`

In [ ]:
ALTER TABLE `venta` DROP COLUMN `latitud`;
ALTER TABLE `venta` DROP COLUMN `longitud`;ALTER TABLE `venta` MODIFY `cantidad` INTEGER

In [ ]:
-- normalización tabla cliente
SELECT * FROM `cliente`;

SELECT CHAR_LENGTH(`x`) FROM `cliente`;
-- número de carácteres: 12

SELECT CHAR_LENGTH(`y`) FROM `cliente`;
-- número de carácteres: 12

ALTER TABLE `cliente` ADD `latitud` DECIMAL(13,10) NOT NULL DEFAULT '0' AFTER `y`, ADD `longitud` DECIMAL(13,10) NOT NULL DEFAULT '0' AFTER `latitud`;

SELECT * FROM `cliente`;

UPDATE `cliente` SET `x` = '0' WHERE `x` = '';
UPDATE `cliente` SET `y` = '0' WHERE `y` = '';

UPDATE `cliente` SET `longitud` = REPLACE((`x`), (','), ('.'));

UPDATE `cliente` SET `latitud` = REPLACE((`y`), (','), ('.'));

SELECT * FROM `cliente`;

ALTER TABLE `cliente` DROP `x`, DROP `y`;

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

7.  Buscar valores faltantes y campos inconsistentes en las tablas sucursal, proveedor, empleado y cliente. De encontrarlos, deberás corregirlos o desestimarlos. Propone y realiza una acción correctiva sobre ese problema.

| Tabla      | Columna          | Nro Registros Faltantes |
| :--------: | :--------------: | :---------------------: |
|  Sucursal  | N/A              |   0                     |
|  Proveedor | Nombre           |   2                     |
|  Empleados | N/A              |   0                     |
|  cliente   | Provincia        |  31                     |
|  cliente   | Nombre Apellido  |  46                     |
|  cliente   | Domicilio        |  48                     |
|  cliente   | Telefono         |  90                     |
|  cliente   | Localidad        |  32                     |
|  cliente   | x                |  62                     |
|  cliente   | y                |  60                     |

Se crean las tablas `aux_venta`, `aux_proveedor`, `aux_cliente` y allí se han de almacenar los registros que presenten problemas de las tablas correspondientes: `venta`, `proveedor`, `cliente`, y los campos de las tablas nativas se han de completar con: 'Sin dato'.

In [ ]:
DROP TABLE IF EXISTS `aux_cliente`;
CREATE TABLE IF NOT EXISTS `aux_cliente` (
	`id_cliente`					INTEGER,
	`provincia`			VARCHAR(50),
	`nombre_apellido`	VARCHAR(80),
	`domicilio`			VARCHAR(150),
	`telefono`			VARCHAR(30),
	`edad`				VARCHAR(5),
	`localidad`			VARCHAR(80),
	`x`			VARCHAR(30),
	`y`			VARCHAR(30),
	`col10`				VARCHAR(1)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_spanish_ci;

INSERT INTO `aux_cliente`
	SELECT * FROM `cliente` WHERE `id_cliente` IS NULL OR TRIM(`id_cliente`) = ''
    OR `provincia` IS NULL OR TRIM(`provincia`) = ''
    OR `nombre_apellido` IS NULL OR TRIM(`nombre_apellido`) = ''
    OR `domicilio` IS NULL OR TRIM(`domicilio`) = ''
    OR `telefono` IS NULL OR TRIM(`telefono`) = ''
    OR `edad` IS NULL OR TRIM(`edad`) = ''
    OR `localidad` IS NULL OR TRIM(`localidad`) = ''
    OR `x` IS NULL OR TRIM(`x`) = ''
    OR `y` IS NULL OR TRIM(`y`) = '';
    
ALTER TABLE `aux_cliente` DROP COLUMN `col10`;

SELECT * FROM aux_cliente;

SET SQL_SAFE_UPDATES = 0;

UPDATE `aux_cliente`
	SET
		`provincia` = CASE WHEN TRIM(`provincia`) = "" OR ISNULL(`provincia`) THEN 'Sin Dato' ELSE `provincia` END,
		`nombre_apellido` = CASE WHEN TRIM(`nombre_apellido`) = "" OR ISNULL(`nombre_apellido`) THEN 'Sin Dato' ELSE `nombre_apellido` END,
		`domicilio` = CASE WHEN TRIM(`domicilio`) = "" OR ISNULL(`domicilio`) THEN 'Sin Dato' ELSE `domicilio` END,
		`telefono` = CASE WHEN TRIM(`telefono`) = "" OR ISNULL(`provincia`) THEN 'Sin Dato' ELSE `provincia` END,
		`localidad` = CASE WHEN TRIM(`localidad`) = "" OR ISNULL(`localidad`) THEN 'Sin Dato' ELSE `localidad` END,
		`x` = CASE WHEN TRIM(`x`) = "" OR ISNULL(`x`) THEN '0' ELSE `x` END,
		`y` = CASE WHEN TRIM(`y`) = "" OR ISNULL(`y`) THEN '0' ELSE `y` END;
        
UPDATE `cliente`
	SET
		`provincia` = CASE WHEN TRIM(`provincia`) = "" OR ISNULL(`provincia`) THEN 'Sin Dato' ELSE `provincia` END,
		`nombre_apellido` = CASE WHEN TRIM(`nombre_apellido`) = "" OR ISNULL(`nombre_apellido`) THEN 'Sin Dato' ELSE `nombre_apellido` END,
		`domicilio` = CASE WHEN TRIM(`domicilio`) = "" OR ISNULL(`domicilio`) THEN 'Sin Dato' ELSE `domicilio` END,
		`telefono` = CASE WHEN TRIM(`telefono`) = "" OR ISNULL(`provincia`) THEN 'Sin Dato' ELSE `provincia` END,
		`localidad` = CASE WHEN TRIM(`localidad`) = "" OR ISNULL(`localidad`) THEN 'Sin Dato' ELSE `localidad` END,
		`x` = CASE WHEN TRIM(`x`) = "" OR ISNULL(`x`) THEN '0' ELSE `x` END,
		`y` = CASE WHEN TRIM(`y`) = "" OR ISNULL(`y`) THEN '0' ELSE `y` END;
        
SELECT * FROM `cliente`;

DROP TABLE IF EXISTS `aux_proveedor`;
CREATE TABLE IF NOT EXISTS `aux_proveedor` (
	`id_proveedor`		INTEGER,
	`nombre`			VARCHAR(80),
	`domicilio`		VARCHAR(150),
	`ciudad`			VARCHAR(80),
	`provincia`		VARCHAR(50),
	`pais`			VARCHAR(20),
	`departamento`	VARCHAR(80)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_spanish_ci;


INSERT INTO `aux_proveedor`
	SELECT * FROM `proveedor`
    WHERE `nombre` IS NULL OR TRIM(`nombre`) = '';

SELECT * FROM `aux_proveedor`;

UPDATE `aux_proveedor`  SET `nombre` = 'Sin Dato' 
	WHERE `nombre` IS NULL OR TRIM(`nombre`) = '';
    
SELECT * FROM `aux_proveedor`;

UPDATE `proveedor`  SET `nombre` = 'Sin Dato' 
	WHERE `nombre` IS NULL OR TRIM(`nombre`) = '';

SELECT * FROM `proveedor`;

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

8.  Chequear la consistencia de los campos precio y cantidad de la tabla de ventas.

Se eliminó la columna precios de la tabla `venta` ya que dicha información se puede obtener a partir de una consulta de unión ente la tabla `venta` y la tabla `producto`.

Los campos 'vacíos' en la columna `cantidad` de la tabla `venta` se coloracarón como nulos, los resgistros que presentaban problemas debido a usencia de datos en las columnas `precio` y/o `cantidad` se guardaron en la tabla `aux_venta`.

In [ ]:
-- Crear una consulta, a partir de las tablas venta y producto en la cual se mueste el precio del producto y la cantidad de articulos ventidados para ese producto.

SELECT `venta`.`id_venta`, `venta`.`fecha`, `venta`.`fecha_entrega`, `venta`.`id_canal`, `venta`.`id_cliente`, `venta`.`id_sucursal`, `venta`.`id_empleado`, `venta`.`id_producto`, `producto`.`descripcion_producto`, `producto`.`precio`, `venta`.`cantidad`
    FROM `producto`
    RIGHT OUTER JOIN `venta`
    ON `producto`.`id_producto` = `venta`.`id_producto`;

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

9.  Utilizar la funcion provista 'UC_Words' para modificar a letra capital los campos que contengan descripciones para todas las tablas.

In [ ]:
SELECT * FROM `cliente`;

UPDATE `cliente`
	SET
		`provincia` = CASE WHEN (`provincia`)IS NOT NULL THEN UC_Words(`provincia`) ELSE `provincia` END,
        `nombre_apellido` = CASE WHEN (`nombre_apellido`)IS NOT NULL THEN UC_Words(`nombre_apellido`) ELSE `nombre_apellido` END,
		`domicilio` = CASE WHEN (`domicilio`)IS NOT NULL THEN UC_Words(`domicilio`) ELSE `domicilio` END,
		`localidad` = CASE WHEN (`localidad`)IS NOT NULL THEN UC_Words(`localidad`) ELSE `localidad` END;

SELECT * FROM `compra`;

-- No posee campos descriptivos

SELECT * FROM `gasto`;

-- No posee campos descriptivos

SELECT * FROM `sucursal`;

UPDATE `sucursal`
	SET
		`sucursal` = CASE WHEN (`sucursal`)IS NOT NULL THEN UC_Words(`sucursal`) ELSE `sucursal` END,
        `domicilio` = CASE WHEN (`domicilio`)IS NOT NULL THEN UC_Words(`domicilio`) ELSE `domicilio` END,
		`localidad` = CASE WHEN (`localidad`)IS NOT NULL THEN UC_Words(`localidad`) ELSE `localidad` END,
		`provincia` = CASE WHEN (`provincia`)IS NOT NULL THEN UC_Words(`provincia`) ELSE `provincia` END;

SELECT * FROM `tipo_gasto`;

-- No posee campos descriptivos

SELECT * FROM `venta`;

-- No posee campos descriptivos

SELECT * FROM `canal_venta`;

-- No posee campos descriptivos

SELECT * FROM `empleado`;

UPDATE `empleado`
	SET
		`apellido` = CASE WHEN (`apellido`)IS NOT NULL THEN UC_Words(`apellido`) ELSE `apellido` END,
        `nombre` = CASE WHEN (`nombre`)IS NOT NULL THEN UC_Words(`nombre`) ELSE `nombre` END,
		`sucursal` = CASE WHEN (`sucursal`)IS NOT NULL THEN UC_Words(`sucursal`) ELSE `sucursal` END,
		`sector` = CASE WHEN (`sector`)IS NOT NULL THEN UC_Words(`sector`) ELSE `sector` END,
        `cargo` = CASE WHEN (`cargo`)IS NOT NULL THEN UC_Words(`cargo`) ELSE `cargo` END;

SELECT * FROM `producto`;

UPDATE `producto`
	SET
		`descripcion_producto` = CASE WHEN (`descripcion_producto`)IS NOT NULL THEN UC_Words(`descripcion_producto`) ELSE `descripcion_producto` END,
        `tipo` = CASE WHEN (`tipo`)IS NOT NULL THEN UC_Words(`tipo`) ELSE `tipo` END;


SELECT * FROM `proveedor`;
	

UPDATE `proveedor`
	SET
		`nombre` = CASE WHEN (`nombre`)IS NOT NULL THEN UC_Words(`nombre`) ELSE `nombre` END,
        `domicilio` = CASE WHEN (`domicilio`)IS NOT NULL THEN UC_Words(`domicilio`) ELSE `domicilio` END,
        `ciudad` = CASE WHEN (`ciudad`)IS NOT NULL THEN UC_Words(`ciudad`) ELSE `ciudad` END,
        `provincia` = CASE WHEN (`provincia`)IS NOT NULL THEN UC_Words(`provincia`) ELSE `ciudad` END,
        `pais` = CASE WHEN (`pais`)IS NOT NULL THEN UC_Words(`pais`) ELSE `pais` END,
        `departamento` = CASE WHEN (`departamento`)IS NOT NULL THEN UC_Words(`departamento`) ELSE `departamento` END;

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

10.  Chequear que no haya claves duplicadas, y de encontrarla en alguna de las tablas, proponer una solución.

In [ ]:
-- esta consulta devulve los id duplicados y el número de id duplicados

-- tabla cliente

SELECT COUNT(`id_cliente`) num_id
    FROM `cliente`
    GROUP BY `id_cliente`
    HAVING num_id > 1;

-- tabla compra

SELECT COUNT(`id_compra`) num_id
    FROM `compra`
    GROUP BY `id_compra`
    HAVING num_id > 1;

-- tabla gasto

SELECT COUNT(`id_gasto`) num_id
    FROM `gasto`
    GROUP BY `id_gasto`
    HAVING num_id > 1;

-- tabla gasto

SELECT COUNT(`id_sucursal`) num_id
    FROM `sucursal`
    GROUP BY `id_sucursal`
    HAVING num_id > 1;

-- tabla tipo de gasto

SELECT `id_tipo_gasto`, COUNT(`id_tipo_gasto`) num_id
    FROM `tipo_gasto`
    GROUP BY `id_tipo_gasto`
    HAVING num_id > 1;

-- tabla venta

SELECT `id_venta`, COUNT(`id_venta`) num_id
    FROM `venta`
    GROUP BY `id_venta`
    HAVING num_id > 1;

-- tabla canal de venta

SELECT `id_canal`, COUNT(`id_canal`) num_id
    FROM `canal_venta`
    GROUP BY `id_canal`
    HAVING num_id > 1;

-- tabla empleado

SELECT `id_empleado`, COUNT(`id_empleado`) num_id
    FROM `empleado`
    GROUP BY `id_empleado`
    HAVING num_id > 1;

-- tabla producto

SELECT `id_producto`, COUNT(`id_producto`) num_id
    FROM `producto`
    GROUP BY `id_producto`
    HAVING num_id > 1;

-- tabla proveedor

SELECT `id_proveedor`, COUNT(`id_proveedor`) num_id
    FROM `proveedor`
    GROUP BY `id_proveedor`
    HAVING num_id > 1;

La unica tabla con id duplicados fue la tabla `empleado` con un total de 17 id duplicados, los cuales afectan a 35 registros.

In [ ]:
-- esta consulta devuelve unicamente los id duplicados

SELECT id_empleado 
    FROM (SELECT `id_empleado`, COUNT(`id_empleado`) num_id
        FROM `empleado`
        GROUP BY `id_empleado`
        HAVING num_id > 1) AS id_duplicados;

In [ ]:
-- esta consulta devuelve los datos de los empleados con id duplicados


SELECT * FROM `empleado`
    JOIN (SELECT `id_empleado`, COUNT(`id_empleado`) num_id
        FROM `empleado`
        GROUP BY `id_empleado`
        HAVING num_id > 1) AS `duplicado`
    ON `empleado`.`id_empleado` = `duplicado`.`id_empleado`
    ORDER BY `empleado`.`id_empleado` ASC;

<b> Nota </b>

En la consulta anterior se utilizó la clausula `JOIN`, ya que la se está haciendo el barrido de la instrucción para un rango de valores, por lo tanto, dicha acción no puede ser ejecutada por la instrucción `WHERE`, ya que esta solo maneja valores puntuales.

In [ ]:
/* Propuesta para solucionar el error de id_empleado duplicados */

-- Generar la clave única tabla `empleado` mediante creacion de clave subrogada.
-- Crear una nueva columna que almacenara el `id_sucursal` en la tabla `empleado`.
-- Rellenar la columna `id_sucursal` en la tabla `empleado`.
-- Crear la columna `codigo_empleado` en la tabla `empleado`.
-- Rellenar la columna `codigo_empleado` con los datos de la columna `id_empleado`.
-- Rellenar la columna id_empleado con la clave subrogada.
-- Modificar la llave foranea de `empleado` en la tabla `venta`.

1.  Generar la clave única de la tabla `empleado` mediante creacion de clave subrogada.

```sql
    `id_empleado` = ((id_sucursal * 1000000) + codigo_empleado)
```
*   Se parte de la premisa de que por sucursal no deberían existir empleados con el mismo id, a pesar de que en el maestro de empleado si los haya, cuya proyección es nacional. En ese sentido, la clave subrogada se generará a partir de la combinación del `id_sucursal` y el `id_empleado`.
*   Este método tambien facilita la inserción de la nueva clave en la tabla venta, pueden se trata de una operación aritmetica que se puede aplicar para todo el barrido de la tabla.

2.  Crear una nueva columna que almacenara el `id_sucursal` en la tabla `empleado`.

In [ ]:
ALTER TABLE `empleado` ADD `id_sucursal` INT NULL DEFAULT '0' AFTER `sucursal`;

3.  Rellenar la columna `id_sucursal` en la tabla `empleado`.

*   Para rellenar la columna id_sucursal de la tabla empleado, es necesario implementar la instrocción JOIN, la cual permitirá aparear las tablas empleado y sucursal mediante las coincidencia halladas en las columnas sucursal de ambas tablas. Es necesario corroborar la uniformidad de los datos almacenados en dichas columnas para que las coincidencias puedan ser efectivas.

In [ ]:
UPDATE empleado SET sucursal = 'Mdq 1' WHERE Sucursal = 'Mdq1';
UPDATE empleado SET sucursal = 'Mdq 2' WHERE Sucursal = 'Mdq2';
UPDATE empleado SET sucursal = 'Rosario 1' WHERE Sucursal = 'Rosario1';
UPDATE empleado SET sucursal = 'Rosario 2' WHERE Sucursal = 'Rosario2 ';
UPDATE sucursal SET sucursal = 'Mdq 1' WHERE Sucursal = 'Mdq1';
UPDATE sucursal SET sucursal = 'Mdq 2' WHERE Sucursal = 'Mdq2';
UPDATE sucursal SET sucursal = 'Rosario 1' WHERE Sucursal = 'Rosario1';
UPDATE sucursal SET sucursal = 'Rosario 2' WHERE Sucursal = 'Rosario2 ';
UPDATE sucursal SET sucursal = 'Mendoza 1' WHERE Sucursal = 'Mendoza1';
UPDATE sucursal SET sucursal = 'Mendoza 2' WHERE Sucursal = 'Mendoza2';
UPDATE empleado SET sucursal = 'Córdoba Quiroz' WHERE Sucursal = 'Cordoba Quiroz';

In [ ]:
UPDATE empleado e JOIN sucursal s
	ON (e.sucursal = s.sucursal)
SET e.id_sucursal = s.id_sucursal;

-- eliminación columna sucursal
ALTER TABLE `empleado` DROP `sucursal`;
SELECT * FROM `empleado`;

4.  Crear la columna `codigo_empleado` en la tabla `empleado`.

*   La columna código empleado almacenará los registros originales de la columna id_empleado.

In [ ]:
ALTER TABLE `empleado` ADD `codigo_empleado` INTEGER NULL DEFAULT '0' AFTER `id_empleado`;

5.  Rellenar la columna `codigo_empleado` con los datos de la columna `id_empleado`.

In [ ]:
UPDATE `empleado` SET `codigo_empleado` = `id_empleado`;

6.  Rellenar la columna `id_empleado` con la clave subrogada.

In [ ]:
UPDATE `empleado` SET `id_empleado` = ((id_sucursal * 1000000) + codigo_empleado);

-- chequeo de claves duplicadas

SELECT `id_empleado`, COUNT(`id_empleado`) num_id
    FROM `empleado`
    GROUP BY `id_empleado`
    HAVING num_id > 1;

SELECT * FROM `empleado`
    JOIN (SELECT `codigo_empleado`, COUNT(`codigo_empleado`) num_id
        FROM `empleado`
        GROUP BY `codigo_empleado`
        HAVING num_id > 1) AS `duplicado`
    ON `empleado`.`codigo_empleado` = `duplicado`.`codigo_empleado`
    ORDER BY `empleado`.`codigo_empleado` ASC;

7.  Modificar la llave foranea de `empleado` en la tabla `venta`.

In [ ]:
UPDATE `venta` SET `id_empleado` = ((id_sucursal * 1000000) + id_empleado);

11. Generar dos nuevas tablas a partir de la tabla 'empelado' que contengan las entidades Cargo y Sector.

12. Generar una nueva tabla a partir de la tabla 'producto' que contenga la entidad Tipo de Producto.

In [ ]:

SELECT * FROM `producto`;

SELECT * FROM `producto` WHERE TRIM(`tipo`) = '';
-- Hay 12 campos vacíos para la columna `tipo`, se rellenarán dichos campo con el valor nulo.

-- Reemplazo los campos vacío por el valor null
UPDATE `producto` SET `tipo` = NULL WHERE TRIM(`tipo`) = '';

-- Ests consulta muestra los tipos de productos distintos valor nulo, en total hay 10 categorías
SELECT DISTINCT(`tipo`) FROM `producto` WHERE `tipo` IS NOT NULL ORDER BY `tipo` ASC;

-- Ests consulta muestra los productos con tipo de producto nulo.
SELECT * FROM `producto` WHERE `tipo` IS NULL;

-- creo la tabla tipo_producto	
DROP TABLE IF EXISTS `tipo_producto`;
/*
CREATE TABLE IF NOT EXISTS `tipo_producto` (
 `id_tipo_producto`         INTEGER AUTO_INCREMENT,
 `descripcion`              VARCHAR(50)     
)ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_spanish_ci;

-- Arroja el error : Error Code: 1075. Incorrect table definition; there can be only one auto column and it must be defined as a key
*/
CREATE TABLE IF NOT EXISTS `tipo_producto` (
 `id_tipo_producto`         INTEGER NOT NULL AUTO_INCREMENT PRIMARY KEY,
 `descripcion`              VARCHAR(50)     
)ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_spanish_ci;

SHOW FULL COLUMNS FROM `tipo_producto`;

-- relleno la tabla tipo_producto con la descripcion del tipo de producto, a partir de la tabla producto y en orden alfabético
INSERT INTO `tipo_producto` (`descripcion`)
    SELECT DISTINCT(`tipo`) 
        FROM `producto` 
        WHERE `tipo` IS NOT NULL 
        ORDER BY `tipo` ASC;

SELECT * FROM `tipo_producto`;

-- creo el campo id_tipo_prodcuto en la tabla producto antes de la columna tipo

ALTER TABLE `producto` ADD `id_tipo_producto` INTEGER NOT NULL DEFAULT '0' AFTER `descripcion_producto`;

SELECT * FROM `producto`;


-- relleno la columna id_tipo_prodcuto en la tabla producto
UPDATE `producto` p JOIN `tipo_producto` tp
	ON (p.`tipo` = tp.`descripcion`)
SET p.`id_tipo_producto` = tp.`id_tipo_producto`;

SELECT DISTINCT(`id_tipo_producto`), `tipo` FROM `producto` ORDER BY `id_tipo_producto`;


-- elimino la columna tipo de la tabla producto 
ALTER TABLE `producto` DROP `tipo`;

SELECT * FROM `producto`;

13. Es necesario contar con una tabla de localidades del país con el fin de evaluar la apertura de una nueva sucursal y mejorar nuestros datos. A partir de los datos en las tablas cliente, sucursal y proveedor hay que generar una tabla definitiva de Localidades y Provincias. Utilizando la nueva tabla de Localidades controlar y corregir (Normalizar) los campos Localidad y Provincia de las tablas cliente, sucursal y proveedor.

hola mmwbo

In [ ]:
SELECT * FROM `cliente`;
SELECT DISTINCT(`localidad`) FROM `cliente`;
SELECT * FROM `sucursal`;
SELECT DISTINCT(`provincia`) FROM `sucursal`;
SELECT * FROM `proveedor`;
SELECT DISTINCT(`ciudad`) FROM `proveedor`;

SELECT DISTINCT `localidad`, `provincia`, `localidad`, `provincia`, 0 FROM `cliente`
UNION
SELECT DISTINCT `localidad`, `provincia`, `localidad`, `provincia`, 0 FROM `sucursal`
UNION
SELECT DISTINCT `ciudad`, `provincia`, `ciudad`, `provincia`, 0 FROM `proveedor`
ORDER BY 2, 1;

DROP TABLE IF EXISTS `aux_localidad`;
CREATE TABLE IF NOT EXISTS `aux_localidad` (
	`localidad_original`	VARCHAR(80),
	`provincia_original`	VARCHAR(50),
	`localidad_normalizada`	VARCHAR(80),
	`provincia_normalizada`	VARCHAR(50),
	`id_localidad`			INTEGER
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_spanish_ci;

SELECT * FROM `aux_localidad`;

INSERT INTO `aux_localidad` (`localidad_original`, `provincia_original`, `localidad_normalizada`, `provincia_normalizada`, `id_localidad`)
SELECT DISTINCT `localidad`, `provincia`, `localidad`, `provincia`, 0 FROM `cliente`
UNION
SELECT DISTINCT `localidad`, `provincia`, `localidad`, `provincia`, 0 FROM `sucursal`
UNION
SELECT DISTINCT `ciudad`, `provincia`, `ciudad`, `provincia`, 0 FROM `proveedor`
ORDER BY 2, 1;

SELECT * FROM `aux_localidad`;

UPDATE `aux_localidad` SET provincia_normalizada = 'Buenos Aires'
WHERE provincia_original IN ('Caba',
                             'C Debuenos Aires',
                             'Bs As',
                             'Bs.As.',
                             'Buenos Aires',
                             'B. Aires',
                             'B.Aires',
                             'Provincia De Buenos Aires',
                             'Prov De Bs As',
                             'Ciudad De Buenos Aires',
                             'Pcia Bs As',
                             'Pcia Bs As',
                             'Prov De Bs As.');

SELECT DISTINCT(`provincia_normalizada`) FROM `aux_localidad`;

UPDATE `aux_localidad` SET `localidad_normalizada` = 'Capítal Federal'
WHERE `localidad_original` IN ('Boca De Atencion Monte Castro',
                            'Caba',
                            'Cap.   Federal',
                            'Cap. Fed.',
                            'Capfed',
                            'Capital',
                            'Capital Federal',
                            'Cdad De Buenos Aires',
                            'Ciudad De Buenos Aires')
AND `provincia_normalizada` = 'Buenos Aires';

SELECT DISTINCT(`localidad_normalizada`) FROM `aux_localidad` ORDER BY `localidad_normalizada`;

UPDATE `aux_localidad` SET localidad_normalizada = 'Córdoba'
WHERE localidad_original IN ('Coroba',
                            'Cordoba',
							'Cã³rdoba')
AND provincia_normalizada = 'Córdoba';

DROP TABLE IF EXISTS `localidad`;
CREATE TABLE IF NOT EXISTS `localidad` (
  `id_localidad` int(11) NOT NULL AUTO_INCREMENT,
  `localidad` varchar(80) NOT NULL,
  `provincia` varchar(80) NOT NULL,
  `id_provincia` int(11) NOT NULL,
  PRIMARY KEY (`id_localidad`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_spanish_ci;

DROP TABLE IF EXISTS `provincia`;
CREATE TABLE IF NOT EXISTS `provincia` (
  `id_provincia` int(11) NOT NULL AUTO_INCREMENT,
  `provincia` varchar(50) NOT NULL,
  PRIMARY KEY (`id_provincia`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_spanish_ci;

SELECT	DISTINCT localidad_normalizada, provincia_normalizada, 0
FROM aux_localidad
ORDER BY provincia_normalizada, localidad_normalizada;

SELECT DISTINCT provincia_normalizada
FROM aux_localidad
ORDER BY provincia_normalizada;

INSERT INTO localidad (localidad, provincia, id_provincia)
SELECT	DISTINCT localidad_normalizada, provincia_normalizada, 0
FROM aux_localidad
ORDER BY provincia_normalizada, localidad_normalizada;

SELECT * FROM `localidad`;

INSERT INTO provincia (provincia)
SELECT DISTINCT Provincia_Normalizada
FROM aux_localidad
ORDER BY Provincia_Normalizada;

SELECT * FROM `provincia`;

UPDATE localidad l JOIN provincia p
	ON (l.provincia = p.provincia)
SET l.id_provincia = p.id_provincia;

SELECT * FROM `aux_localidad`;

UPDATE aux_localidad a JOIN localidad l 
			ON (l.localidad = a.localidad_normalizada
                AND a.provincia_normalizada = l.provincia)
SET a.id_localidad = l.id_localidad;

ALTER TABLE `cliente` ADD `id_localidad` INT NOT NULL DEFAULT '0' AFTER `localidad`;
ALTER TABLE `proveedor` ADD `id_localidad` INT NOT NULL DEFAULT '0' AFTER `departamento`;

UPDATE cliente c JOIN aux_localidad a
	ON (c.provincia = a.provincia_original AND c.localidad = a.localidad_original)
SET c.id_localidad = a.id_localidad;

UPDATE sucursal s JOIN aux_localidad a
	ON (s.provincia = a.provincia_original AND s.localidad = a.localidad_original)
SET s.id_localidad = a.id_localidad;

UPDATE proveedor p JOIN aux_localidad a
	ON (p.provincia = a.provincia_original AND p.ciudad = a.localidad_original)
SET p.id_localidad = a.id_localidad;

SELECT * FROM `cliente`;

SELECT * FROM `sucursal`;

SELECT * FROM `proveedor`;

ALTER TABLE `cliente`
  DROP `Provincia`,
  DROP `Localidad`;

ALTER TABLE `proveedor`
  DROP `Ciudad`,
  DROP `Provincia`,
  DROP `Pais`,
  DROP `Departamento`;

ALTER TABLE `sucursal`
  DROP `Localidad`,
  DROP `Provincia`;
  
ALTER TABLE `localidad`
  DROP `Provincia`;

SELECT * FROM `cliente`;
SELECT * FROM `proveedor`;
SELECT * FROM `sucursal`;
SELECT * FROM `localidad`;
SELECT * FROM `provincia`;